cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'wix/brew'

brew 'z'
brew 'git'
brew 'ack'
brew 'fasd'
brew 'wget'
brew 'tree'
brew 'watch'
brew 'watchman' # but who watches... etc
brew 'm-cli'
brew 'vim'
brew 'colordiff'
brew 'npm'
brew 'nvm'
brew 'applesimutils'
brew 'cocoapods'
brew 'youtube-dl'
brew 'ffmpeg'
# lets pretend we use tmux
brew 'tmux'
brew 'jq' # just qidding
brew 'reattach-to-user-namespace' # tmux drama

# first, get some weird fonts
cask 'font-fira-code'
cask 'font-m-plus'
cask 'font-hack'
cask 'font-ubuntu'
cask 'font-input'

# Tools of the trade
cask 'iterm2'
cask 'visual-studio-code'
cask 'atom'
cask 'sourcetree'
cask 'android-studio'
cask 'java'
cask 'android-platform-tools'
cask 'detox-instruments'
cask 'docker'

#browser war 4ever
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'brave-browser'

# motley assortment
cask 'alfred'
cask 'aerial'
cask 'macdown'
cask 'spectacle'
cask 'cheatsheet'
cask 'vlc'
cask 'gimp'
cask 'slack'
