cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'wix/brew'

brew 'ack'
brew 'vim'
brew 'cocoapods'
brew 'applesimutils'
brew 'watch'
brew 'wget'
brew 'fasd'
brew 'git'
brew 'colordiff'
brew 'z'
brew 'npm'
brew 'tmux'
brew 'jq'
brew 'reattach-to-user-namespace' # used by tmux

cask 'font-fira-code'
cask 'font-m-plus'
cask 'font-hack'
cask 'font-ubuntu'
cask 'font-input'
cask 'firefox'
cask 'gimp'
cask 'iterm2'
cask 'google-chrome'
cask 'opera'
cask 'spectacle'
cask 'sequel-pro'
cask 'vlc'
cask 'macdown'
cask 'slack'
cask 'atom'
cask 'visual-studio-code'
cask 'android-studio'
cask 'java'
cask 'android-platform-tools'
cask 'brave-browser'
